UNIT_CHOICES = (
    ('ст. л.', 'Столовая ложка'),
    ('ч. л.', 'Чайная ложка'),
    ('г', 'Грамм'),
    ('кг', 'Килограмм'),
    ('мл', 'Милиграмм'),
    ('л', 'Литр'),
    ('стакан', 'Стакан'),
    ('по вкусу', 'По вкусу'),
    ('шт.', 'Штук'),
    ('капля', 'Капля'),
    ('звездочка', 'Звездочка'),
    ('щепотка', 'Щепотка'),
    ('горсть', 'Горсть'),
    ('кусок', 'Кусок'),
    ('пакет', 'Пакет'),
    ('пучок', 'Пучок'),
    ('долька', 'Долька'),
    ('стручок', 'Стручок'),
    ('стебель', 'Стебель'),
    ('бутылка', 'Бутылка'),
    ('зубчик', 'Зубчик'),
    ('веточка', 'Веточка'),
    ('банка', 'Банка'),
    ('тушка', 'Тушка'),
    ('батон', 'Батон'),
    ('пачка', 'Пачка'),
    ('лист', 'Лист'),
    ('пласт', 'Пласт'),
    ('упаковка', 'Упаковка'),
)
MAX_NAME_LENGTH = 256
MAX_MEASUREMENT_UNIT_LENGTH = 9
MAX_SLUG_LENGTH = 50
MIN_COOKING_TIME_VALUE = 1
MIN_INGREDIENT_AMOUNT = 1
